rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 2]]
---
  def same
    # redirect_to same_path
    @movie = Movie.find params[:id]