rottenpotatoes/app/views/movies/same.html.haml

SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "Kobe"]]
---

= Movie.where(director: @movie.director).inspect